# Chapter 3 - Data Manipulation with Pandas

In the previous chapter, we dove into detail on NumPy and its ndarray object, which
provides efficient storage and manipulation of dense typed arrays in Python.

Pandas is a newer package built on top of NumPy, and provides an
efficient implementation of a DataFrame. DataFrames are essentially multidimensional
arrays with attached row and column labels, and often with heterogeneous
types and/or missing data. As well as offering a convenient storage interface for
labeled data, Pandas implements a number of powerful data operations familiar to
users of both database frameworks and spreadsheet programs

## Installing and Using Pandas

Pandas is built on C and Cython sources

In [250]:
# Importing pandas

import pandas

In [251]:
pandas.__version__

'0.24.2'

In [252]:
import numpy as np
import pandas as pd

## Introducing Pandas Objects

At the very basic level, Pandas objects can be thought of as enhanced versions of NumPy structured arrays in which the rows and columns are identified with labels rather than simple integer indices.

The three fundamental Pandas data structures: the:
- Series, 
- DataFrame, and 
- Index.

### The Pandas Series Object

A Pandas Series is a one-dimensional array of indexed data. It can be created from a
list or array as follows

In [253]:
data = pd.Series([0.25, 0.5, 0.7, 1.0])

In [254]:
data

0    0.25
1    0.50
2    0.70
3    1.00
dtype: float64

The Series wraps both a **sequence of values and a
sequence of indices**, which we can access with the **values and index** attributes. The
values are simply a familiar NumPy array:

In [255]:
data.values

array([0.25, 0.5 , 0.7 , 1.  ])

In [256]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [257]:
data[1]

0.5

In [258]:
data[1:3]

1    0.5
2    0.7
dtype: float64

#### Series as generalized Numpy array

The essential difference is the presence
of the index: while **the NumPy array** has an implicitly defined integer index used
to access the values, **the Pandas Series** has an explicitly defined index associated with
the values.

In [259]:
# Using string as an index
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])

In [260]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [261]:
data['b']

0.5

#### Series as specialized dictionary

Pandas Series a bit like a specialization of a Python
dictionary. A dictionary is a structure that maps arbitrary keys to a set of arbitrary
values, and a Series is a structure that maps typed keys to a set of typed values

In [262]:
population_dict = {'California': 38332521,'Texas': 26448193,'New York': 19651127,
'Florida': 19552860,'Illinois': 12882135}

In [263]:
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [264]:
population['Texas': 'Illinois']

Texas       26448193
New York    19651127
Florida     19552860
Illinois    12882135
dtype: int64

#### Constructing Series Objects

**Note:** Data can be a list or Numpy array, also data can be a scalar, which is repeated to fill the specified index:

In [265]:
# a scalar data
pd.Series(5, index=[100, 200, 300])

100    5
200    5
300    5
dtype: int64

In [266]:
# Data as a dictionary
pd.Series({2:'a', 1:'b', 3:'c'})

2    a
1    b
3    c
dtype: object

### The Pandas DataFrame Object
Like the Series object
discussed in the previous section, the DataFrame can be thought of either as a generalization
of a NumPy array, or as a specialization of a Python dictionary

#### DataFrame as a generalized Numpy array

If a Series is an analog of a one-dimensional array with flexible indices, a DataFrame
is an analog of a two-dimensional array with both flexible row indices and flexible
column names

Just as you might think of a two-dimensional array as an ordered
sequence of aligned one-dimensional columns, you can think of a DataFrame as a
sequence of aligned Series objects. Here, by “aligned” we mean that they share the
same index.

In [267]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
'Florida': 170312, 'Illinois': 149995}

area = pd.Series(area_dict)

In [268]:
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [269]:
states = pd.DataFrame({'population': population, 'area': area})

In [270]:
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [271]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [272]:
states.columns

Index(['population', 'area'], dtype='object')

#### DataFrame as specialized dictionary

In [273]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [274]:
states['population']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
Name: population, dtype: int64

In [275]:
pd.DataFrame(population, columns=['population'])

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [276]:
# Dataframe for list of dicts, using list comprehension
data = [{'a': i, 'b':2*i} for i in range(3)]

In [277]:
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [278]:
pd.DataFrame(np.random.rand(3,2), columns=['foo', 'bar'], index=['a', 'b', 'c'])

        foo       bar
a  0.168714  0.593651
b  0.654367  0.546119
c  0.598616  0.096021

In [279]:
A = np.zeros(3, dtype=[('A', 'i8'), ('B', 'f8')])

In [280]:
A

array([(0, 0.), (0, 0.), (0, 0.)], dtype=[('A', '<i8'), ('B', '<f8')])

In [281]:
pd.DataFrame(A)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

### The Pandas Index Object

**Note** index is immutable i.e. it can not be change

This immutability makes it safer to share indices between multiple DataFrames and
arrays, without the potential for side effects from inadvertent index modification

In [282]:
ind = pd.Index([2,3,5,7,11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [283]:
ind[1]

3

In [284]:
ind[::3]

Int64Index([2, 7], dtype='int64')

In [285]:
ind.shape

(5,)

In [286]:
ind.ndim

1

In [287]:
indA = pd.Index([1,3,5,7,9])
indB = pd.Index([2,3,5,7,11])

In [288]:
# Intersection
indA & indB

Int64Index([3, 5, 7], dtype='int64')

In [289]:
# Union
indA | indB

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [290]:
# symmetric difference
indA ^ indB

Int64Index([1, 2, 9, 11], dtype='int64')

## Data Indexing and Selection

### Data Selection in Series

In [291]:
# Series as dictionary
data = pd.Series([0.25,0.5,0.75,1.0], index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [292]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [293]:
'a' in data

True

In [294]:
data['b']

0.5

In [295]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [296]:
data['e'] = 1.25

In [297]:
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [298]:
# masking
data[(data>0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [299]:
# fancy indexing
data[['a', 'e']]

a    0.25
e    1.25
dtype: float64

**Note:**
Among these, slicing may be the source of the most confusion. Notice that when you
are slicing with an explicit index (i.e., data['a':'c']), the final index is included in
the slice, while when you’re slicing with an implicit index (i.e., data[0:2]), the final
index is excluded from the slice.

In [300]:
data['a': 'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [301]:
data[0:2]

a    0.25
b    0.50
dtype: float64

In [302]:
data = pd.Series(['a', 'b', 'c'], index=[1,3,5])
data

1    a
3    b
5    c
dtype: object

In [303]:
data[1]

'a'

In [304]:
data[1:3]

3    b
5    c
dtype: object

Because of this potential confusion in the case of integer indexes, Pandas provides
some special indexer attributes that explicitly expose certain indexing schemes

First, the
attribute allows indexing and slicing that always references the explicit
loc
index:

In [305]:
data.loc[1]

'a'

In [306]:
data.loc[1:3]

1    a
3    b
dtype: object

The iloc attribute allows indexing and slicing that always references the implicit
Python-style index:

In [307]:
data.iloc[1]

'b'

In [308]:
data.iloc[0]

'a'

In [309]:
data.iloc[1:3]

3    b
5    c
dtype: object

**“explicit is better than implicit.”** The
explicit nature of loc and iloc make them very useful in maintaining clean and readable
code; especially in the case of integer indexes, I recommend using these both to
make code easier to read and understand, and to prevent subtle bugs due to the
mixed indexing/slicing convention

### Data Selection in DataFrame

Recall that a DataFrame acts in many ways like a two-dimensional or structured array,
and in other ways like a dictionary of Series structures sharing the same index.

In [310]:
area = pd.Series({'California': 423967, 'Texas': 695662,
'New York': 141297, 'Florida': 170312,
'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
'New York': 19651127, 'Florida': 19552860,
'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [311]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [312]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [313]:
data.area is data['area']

True

In [314]:
# Modifying object
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [315]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [316]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [317]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [318]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [319]:
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [320]:
data.loc[:'Illinois', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [321]:
data.ix[:3, :'pop']

/Users/user/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

**Note:** Keep in mind that for integer indices, the **ix** indexer is subject to the same potential
sources of confusion as discussed for integer-indexed Series objects.

In [322]:
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [323]:
data.iloc[0,2] = 90
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

### Additional Indexing Conventions

while indexing
refers to columns, slicing refers to rows:

In [324]:
data['Florida':'Illinois']

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [325]:
# Slice can also refer to rows by number rather than by index:
data[1:3]

            area       pop     density
Texas     695662  26448193   38.018740
New York  141297  19651127  139.076746

In [326]:
# Direct masking operations are also interpreted row-wise rather
# column-wise
data[data.density > 100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121

## Operating on Data in Pandas

One of the essential pieces of NumPy is the ability to perform quick element-wise operations, both with basic arithmetic (addition, subtraction, multiplication, etc.) and with more sophisticated operations (trigonometric functions, exponential and logarithmic
functions, etc.

For unary operations like negation and trigonometric functions, these ufuncs will preserve index and column labels in the output, and for binary operations such as addition and multiplication, Pandas will automatically align indices when passing the objects to the ufunc.

#### Ufuncs: Index Preservation

Because Pandas is designed to work with NumPy, any NumPy ufunc will work on Pandas Series and DataFrame objects

In [327]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0,10,4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [328]:
df = pd.DataFrame(rng.randint(0,10,(3,4)), columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [329]:
# Applying a NumPy ufunc on either of these objects,
# the result is another Pandas object with the indices preserved
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [330]:
# A slightly more complex calculation:
np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

### UFuncs: Index Alignment

For binary operations on two Series or DataFrame objects, Pandas will align indices in the process of performing the operation.

This is very convenient when you are working with incomplete data.

In [331]:
# Index Alignment in Series
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
'New York': 19651127}, name='population')

In [332]:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [333]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

**Note:** Any item for which one or the other does not have an entry is marked with NaN, or
“Not a Number,” which is how Pandas marks missing data

In [334]:
A = pd.Series([2,4,6], index=[0,1,2])
B = pd.Series([1,3,5], index=[1,2,3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

**Note:** A.add(B) is equivalent to calling A + B, but allows optional explicit specification of the fill value for any elements in A or B that might be missing:

In [335]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [336]:
# Index alignment in DataFrame
A = pd.DataFrame(rng.randint(0,20,(2,2)), columns=list('AB'))
A

   A   B
0  1  11
1  5   1

In [337]:
B = pd.DataFrame(rng.randint(0,10,(3,3)), columns=list('BAC'))
B

   B  A  C
0  4  0  9
1  5  8  0
2  9  2  6

In [338]:
A + B

      A     B   C
0   1.0  15.0 NaN
1  13.0   6.0 NaN
2   NaN   NaN NaN

In [339]:
fill = A.stack().mean()
A.add(B, fill_value=fill)

      A     B     C
0   1.0  15.0  13.5
1  13.0   6.0   4.5
2   6.5  13.5  10.5

In [340]:
fill

4.5

### Ufuncs: Operations Between DataFrame and Series

When you are performing operations between a DataFrame and a Series, the index and column alignment is similarly maintained

Operations between a DataFrame and a Series are similar to operations between a two-dimensional and one-dimensional NumPy array.

In [341]:
A = rng.randint(10, size=(3,4))
A

array([[3, 8, 2, 4],
       [2, 6, 4, 8],
       [6, 1, 3, 8]])

In [342]:
A - A[0]

array([[ 0,  0,  0,  0],
       [-1, -2,  2,  4],
       [ 3, -7,  1,  4]])

**Note:** According to NumPy's broadcasting rules, substraction between a two-dimensional array and one of its rows is applied row-wise.

In [343]:
df = pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -1 -2  2  4
2  3 -7  1  4

In [344]:
# Operating column-wise
df.subtract(df['R'], axis=0)

   Q  R  S  T
0 -5  0 -6 -4
1 -4  0 -2  2
2  5  0  2  7

In [345]:
halfrow = df.iloc[0,::2]

In [346]:
halfrow

Q    3
S    2
Name: 0, dtype: int64

In [347]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -1.0 NaN  2.0 NaN
2  3.0 NaN  1.0 NaN

**Note:** This preservation and alignment of indices and columns means that operations on
data in Pandas will always maintain the data context, which prevents the types of silly
errors that might come up when you are working with heterogeneous and/or misaligned
data in raw NumPy arrays

## Handling Missing Data

In particular, many interesting
datasets will have some amount of data missing. To make matters even more complicated,
different data sources may indicate missing data in different ways

Missing data can be referred to as ***null, NaN, or NA*** values.

### Trade-Offs in Missing Data Conventions

A number of schemes have been developed to indicate the presence of missing data in a table or DataFrame. Generally, they revolve around one of two strategies: **using a mask that globally indicates missing values, or choosing a sentinel value that indicates a missing entry**.

**In the Masking approach**, the mask might be an entirely separate Boolean array, or it may involve appropriation of one bit in the data representation too locally indicate the null status of a value.

**In the sentinel approach**, the sentinel value could be some data specific convention, such as indicating a missing integer value with -9999 or some rare bit pattern or a more global convention, such as indicating a missing floating-point value with NaN (Not a Number).

**Note:** None of these approaches is without trade-offs: use of a separate mask array requires
allocation of an additional Boolean array, which adds overhead in both storage and
computation. A sentinel value reduces the range of valid values that can be represented,
and may require extra (often non-optimized) logic in CPU and GPU arithmetic.
Common special values like NaN are not available for all data types.

### Missing Data in Pandas

Pandas chose to use sentinels for missing data, and
further chose to use two already-existing Python null values: the special floatingpoint NaN value, and the Python None object.

#### None: Pythonic missing data

The first sentinel value used by Pandas is None, a Python singleton object that is often used for missing data in Python code. Because None is a Python object, it cannot be used in any arbitrary NumPy/Pandas array, but only in arrays with data type 'object' (i.e., arrays of Python objects):

In [348]:
vals1 = np.array([1, None, 3,4])
vals1

array([1, None, 3, 4], dtype=object)

In [349]:
for dtype in ['object', 'int']:
    print('dtype=', dtype)
    %timeit np.arange(1E6, dtype=dtype).sum
    print()

dtype= object
39.3 ms ± 6.93 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype= int
367 µs ± 6.07 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

**Note:** The use of Python objects in an array also means that if you perform aggregations like **sum() or min()** across an array with a **None** value, you will generally get an error:

In [350]:
# vals1.sum()

**Note:** Addition between an integer and None is undefined

#### NaN: Missing numerical data

The other missing data representation, NaN (acronym for Not a Number), is different; it is a special **floating-point value** recognized by all systems that use the standard IEEE floating-point representation:

In [351]:
vals2 = np.array([1,np.nan, 3,4])
vals2.dtype

dtype('float64')

In [352]:
# Regardless of the operation, the result of arithmetic with NaN
# Will be another NaN:

1 + np.nan

nan

In [353]:
0 * np.nan

nan

**Note:** This means that aggregates over the values are well defined i.e., they don't result in error, but not always useful:

In [354]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [355]:
# Some special NumPy aggregations that will ignore these 
# missing values:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

**Note:** NaN is specifically a floating-point value; no equivalent NaN value for integers, strings, or other types.

### Nan and None in Pandas

In [356]:
pd.Series([1,np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

For types that don’t have an available sentinel value, Pandas automatically type-casts
when NA values are present.

In [357]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int64

In [358]:
# Notice that in addition to casting the integer array to 
# floating point, Pandas automatically converts the None 
# to a NaN value

x[0] = None
x

0    NaN
1    1.0
dtype: float64

### Operating on Null Values
Note that Pandas treats None and NaN as essentially interchangeable for indication missing or null values.

There are several useful methods for detecting, removing, and replacing null values in Pandas data structures. They are:
- **Isnull()**: Generate a Boolean mask indicating missing values
- **notnull()**: Opposite of isnull()
- **dropna()**: Return a filtered version of the data
- **fillna()**: Return a copy of the data with missing values filled or imputed

#### Detecting null values
Pandas data structure have two useful methods for detecting null data: **isnull() and notnull()**. Either one will return a Boolean mask over the data.

In [359]:
data = pd.Series([1,np.nan, 'hello', None])

In [360]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [361]:
# Using Boolean mask directly as a Series or DataFrame index:
data[data.notnull()]

0        1
2    hello
dtype: object

#### Dropping null values

In [362]:
data.dropna()

0        1
2    hello
dtype: object

**Note**: for a DataFrame, there are more options.

In [363]:
df = pd.DataFrame([[1, np.nan, 2],
[2, 3, 5],
[np.nan, 4, 6]])

In [364]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [365]:
# By Default, dropna() will drop all rows in which any nul value is
# Present:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [366]:
# Dropping NA values along a different axis; 
# axis=1 drops all columns containing a null value:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [367]:
df.dropna(axis=1)

   2
0  2
1  5
2  6

But this drops some good data as well; you might rather be interested in droppingrows or columns with all NA values, or a majority of NA values. This can be specified through the or parameters, which allow fine control of the number of how thresh nulls to allow through

In [368]:
df[3] = np.nan

In [369]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [370]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [371]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [372]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

#### Filling null values

In [373]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [374]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [375]:
# Forward-fill: 
# This propagate the previous value forward:
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [376]:
# Back-fill
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

For DataFrames, the options are similar, but we can also specify an axis along which
the fills take place:

In [377]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [378]:
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

**Notice** that if a previous value is not available during a forward fill, the NA value
remains.

## Hierarchical Indexing

Hierarchical indexing (also known as multi-indexing), as to do with data indexed by more than one or two keys

### A Multiply Indexed Series

Representing two-dimensional data within a one-dimensional Series

#### The Bad way

In [379]:
index = [('California', 2000), ('California', 2010),
('New York', 2000), ('New York', 2010),
('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956, 18976457, 19378102,
20851820, 25145561]

In [380]:
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [381]:
pop[('California', 2010) : ('Texas', 2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [382]:
# selecting all values form 2010
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

#### The better way: Pandas MultiIndex

In [383]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           codes=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [384]:
# reindexing
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [385]:
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

#### MultiIndex as extra dimension

In [386]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [387]:
# Stack() the opposite operation
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [388]:
pop_df = pd.DataFrame({'total': pop, 'under18': [9267089, 9284094,
4687374, 4318033,
5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [389]:
f_u18 = pop_df['under18'] / pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

## Methods of MultiIndex Creation

In [390]:
df = pd.DataFrame(np.random.rand(4,2), index=[['a', 'a','b', 'b'],
                                             [1,2,1,2]], columns=['data1', 'data2'])
df

        data1     data2
a 1  0.610689  0.177383
  2  0.183253  0.486536
b 1  0.251543  0.499125
  2  0.105671  0.327700

**Note:** if you pass a dictionary with appropriate tuples as keys, Pandas will automatically
recognize this and use a MultiIndex by default:

In [391]:
data = {('California', 2000): 33871648,
('California', 2010): 37253956,
('Texas', 2000): 20851820,
('Texas', 2010): 25145561,
('New York', 2000): 18976457,
('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

### Explicit MultiIndex Constructors

In [392]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1,2,1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [393]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b',2)])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [394]:
pd.MultiIndex.from_product([['a', 'b'], [1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [396]:
pd.MultiIndex(levels=[['a', 'b'], [1,2]], codes=[[0,0,1,1], [0,1,0,1]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

### MultiIndex level names

In [397]:
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

### MultiIndex for columns

In a DataFrame, the rows and columns are completely symmetric, and just as the rows
can have multiple levels of indices, the columns can have multiple levels as well

In [399]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1,2]], names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                    names=['subject', 'type'])

# mock some data
data = np.round(np.random.randn(4,6), 1)
data[:, ::2] *= 10
data *= 37

#create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject       Bob        Guido          Sue
type           HR  Temp     HR  Temp     HR  Temp
year visit
2013 1     -222.0   3.7 -370.0  25.9  -74.0 -18.5
     2       37.0  44.4 -111.0   3.7 -481.0 -62.9
2014 1     -185.0 -11.1   74.0  48.1  481.0  66.6
     2      518.0  22.2 -111.0   0.0  259.0 -62.9

**Note:** This is fundamentally four-dimensional data, where the dimensions are the
subject, the measurement type, the year, and the visit number

In [400]:
health_data['Guido']

type           HR  Temp
year visit
2013 1     -370.0  25.9
     2     -111.0   3.7
2014 1       74.0  48.1
     2     -111.0   0.0

## Indexing and Slicing a MultiIndex

Indexing and slicing on a MultiIndex is designed to be intuitive, and it helps if you
think about the indices as added dimensions.

### Multiply indexed Series

In [401]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [402]:
# Accessing single elements by indexing with multiple terms:
pop['Texas', 2000]

20851820

In [403]:
# partial indexing or indexing just one of the levels
pop['Texas']

year
2000    20851820
2010    25145561
dtype: int64

In [404]:
# partial indexing on lower levels by passing an empty slice in the
# first index:
pop[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [405]:
# Selection based on Boolean masks:
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [406]:
pop[['California', 'Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

### Multipy indexed DataFrames

In [407]:
health_data

subject       Bob        Guido          Sue
type           HR  Temp     HR  Temp     HR  Temp
year visit
2013 1     -222.0   3.7 -370.0  25.9  -74.0 -18.5
     2       37.0  44.4 -111.0   3.7 -481.0 -62.9
2014 1     -185.0 -11.1   74.0  48.1  481.0  66.6
     2      518.0  22.2 -111.0   0.0  259.0 -62.9

In [413]:
# Getting Guido's heart rate
health_data['Guido', 'HR']

year  visit
2013  1       -370.0
      2       -111.0
2014  1         74.0
      2       -111.0
Name: (Guido, HR), dtype: float64

In [423]:
health_data.iloc[:2, :2]

subject       Bob
type           HR  Temp
year visit
2013 1     -222.0   3.7
     2       37.0  44.4

In [424]:
# passing tuple of multiple indices
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1       -222.0
      2         37.0
2014  1       -185.0
      2        518.0
Name: (Bob, HR), dtype: float64

In [426]:
idx = pd.IndexSlice
health_data.loc[idx[:,1], idx[:, 'HR']]

subject       Bob  Guido    Sue
type           HR     HR     HR
year visit
2013 1     -222.0 -370.0  -74.0
2014 1     -185.0   74.0  481.0

## Rearranging Multi-Indices
One of the keys to working with multiply indexed data is knowing how to effectively transform the data.

### Sorted and unsorted indices

In [429]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1,2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.265985
      2      0.731053
c     1      0.923142
      2      0.163475
b     1      0.858511
      2      0.569364
dtype: float64

In [430]:
try:
    data['a':'b']
except KeyError as e:
    print(type(e))
    print(e)

<class 'pandas.errors.UnsortedIndexError'>
'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [431]:
data = data.sort_index()
data

char  int
a     1      0.265985
      2      0.731053
b     1      0.858511
      2      0.569364
c     1      0.923142
      2      0.163475
dtype: float64

In [432]:
data['a':'b']

char  int
a     1      0.265985
      2      0.731053
b     1      0.858511
      2      0.569364
dtype: float64

### Stacking and unstacking indices

In [433]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [434]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [437]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

### Index setting and resetting

Another way to rearrange hierarchical data is to turn the index labels into columns; this can be accomplished with the reset_index method

In [438]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [439]:
# building a MultiIndex from column values
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

## Data Aggregations on Multi-Indices

For hierarchically indexed data, these can be passed a
level parameter i.e.(mean(), sum(), max()) that controls which subset of the data the aggregate is computed on

In [440]:
health_data

subject       Bob        Guido          Sue
type           HR  Temp     HR  Temp     HR  Temp
year visit
2013 1     -222.0   3.7 -370.0  25.9  -74.0 -18.5
     2       37.0  44.4 -111.0   3.7 -481.0 -62.9
2014 1     -185.0 -11.1   74.0  48.1  481.0  66.6
     2      518.0  22.2 -111.0   0.0  259.0 -62.9

In [447]:
health_data.mean(level='year')

subject    Bob         Guido           Sue
type        HR   Temp     HR   Temp     HR   Temp
year
2013     -92.5  24.05 -240.5  14.80 -277.5 -40.70
2014     166.5   5.55  -18.5  24.05  370.0   1.85